---
kind: enumMember
id: F:Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.CircularParentage
enum: Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
source: html/92f21b30-036d-9fa8-0662-b5d0e7c474de.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryErrorType.CircularParentage

A sub-node has been specified as a parent of one of its ancestors.